Revit 2027 API
DefinitionBindingMap.ForwardIterator Method
Retrieve a forward moving iterator to the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual DefinitionBindingMapIterator ForwardIterator()
Public Overridable Function ForwardIterator As DefinitionBindingMapIterator
public:
virtual DefinitionBindingMapIterator^ ForwardIterator()
abstract ForwardIterator : unit -> DefinitionBindingMapIterator
override ForwardIterator : unit -> DefinitionBindingMapIterator
Return Value
DefinitionBindingMapIterator
Returns a forward moving iterator to the map.
See Also
Reference
DefinitionBindingMap Class
Autodesk.Revit.DB Namespace